In [1]:
import pandas as pd
import numpy as np

In [ ]:
# selection
# 데이터를 선명하게 보기 좋다.
df.head(2).T

In [ ]:
df[['account', 'street', 'state']].head()

In [ ]:
df['account'][:3]

In [ ]:
# boolean indexing
account_series = df['account']
account_series[account_series < 250000]

In [ ]:
# index 지정
df.index = df['account']

In [ ]:
# del
del df['account']

In [ ]:
# value selection
# column index number
df[['name', 'street']][:2]

# df.loc column index name
df.loc[[211829, 320563],['name','street']]

# df.iloc column number and index number
df.iloc[:2,:2]

In [ ]:
# reindex
df.index = list(range(0, 15))

In [ ]:
# reset index
df.reset_index()

# 기존 인덱스 제거
df.reset_index(inplace=True, drop=True)

In [ ]:
# data drop
# index
df.drop(1)
# 여러 개의 index
df.drop([0,1,2,3,4])
# 원본 df 수정
df.drop(1, inplace=True)

In [ ]:
# 열 삭제
df.drop('city', axis = 1)

In [ ]:
# 값 확인 numpy array
df.values

### series operation

In [2]:
import pandas as pd

s1 = pd.Series(range(1,6), index=list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
s2 = pd.Series(range(5, 11), index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [4]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [5]:
s1+s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [7]:
# dataframe operation
import numpy as np
df1 = pd.DataFrame(np.arange(9).reshape(3,3),
columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [8]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4),
        columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [10]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [11]:
# Series + Dataframe
df = pd.DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
s2 = pd.Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [13]:
# 그냥 덧셈은 안 된다.
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [14]:
# axis를 기준으로 row broadcasing
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [ ]:
# lambda, map, apply

In [15]:
# map for series
s1 = pd.Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [16]:
s1.map(lambda x:x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [17]:
# dict로 데이터 교체
z = {1:"A", 2:"B", 3:"C"}
s1.map(z).head()

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [18]:
# 같은 위치 데이터를 다른 Series로 전환
s2 = pd.Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [20]:
df = pd.read_csv("data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [21]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [22]:
df['sex_code'] = df.sex.map({"male":0, "female":1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [23]:
# replace
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [24]:
# Target list, Conversion list
df.sex.replace(
    ['male','female'],
    [0,1], inplace=True)
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [25]:
# apply for dataframe
df_info = df[['earn', 'height', 'age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [26]:
f = lambda x: x.max()-x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [27]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [28]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [29]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

In [30]:
f = lambda x:np.mean(x)
df_info.apply(f)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [31]:
df_info.apply(np.mean)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [32]:
df_info.mean()

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [33]:
def f(x):
    return pd.Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index=['min','max','mean','null']
    )

df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000

In [34]:
f = lambda x:x//2
# applymap 모든 값에 적용
df_info.applymap(f).head()

      earn  height  age
0  39785.0    36.0   24
1  48198.0    33.0   31
2  24355.0    31.0   16
3  40239.0    31.0   47
4  41044.0    31.0   21

In [35]:
f = lambda x:x**2
# Series의 경우 apply를 써서 모든 값에 함수 적용
df_info['earn'].apply(f)

0       6.331592e+09
1       9.292379e+09
2       2.372729e+09
3       6.476724e+09
4       6.738661e+09
            ...
1374    9.104329e+08
1375    6.176974e+08
1376    1.879825e+08
1377    9.106124e+09
1378    9.168947e+07
Name: earn, Length: 1379, dtype: float64

### pandas built-in functions

In [42]:
df = pd.read_csv("data/wages.csv")

In [43]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [44]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [45]:
np.array(dict(enumerate(df['race'].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [46]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['race'].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [47]:
df['race'].replace(to_replace=key, value=value, inplace=True)

In [48]:
value = list(map(int, np.array(list(enumerate(df['sex'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['sex'].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['male', 'female'])

In [49]:
df['sex'].replace(to_replace=key, value=value, inplace=True)
df.head()

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [50]:
# column 별 합
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [51]:
# row 별 합
df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80654.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [52]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [53]:
df.isnull().sum()
# df.isnull().sum() / len(df)

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [54]:
# column 값을 기준으로 정렬
df.sort_values(['age','earn'], ascending=True).head(10)

             earn  height  sex  race  ed  age
1038   -56.321979   67.81    0     2  10   22
800    -27.876819   72.29    0     0  12   22
963    -25.655260   68.90    0     0  12   22
1105   988.565070   64.71    1     0  12   22
801   1000.221504   64.09    1     0  12   22
862   1002.023843   66.59    1     0  12   22
933   1007.994941   68.26    1     0  12   22
988   1578.542814   64.53    0     0  12   22
522   1955.168187   69.87    1     3  12   22
765   2581.870402   64.79    1     0  12   22

In [55]:
# 피어슨 상관계수
df.age.corr(df.earn)

0.07400349177836056

In [56]:
# 공분산
df.age.cov(df.earn)

36523.69921040891

In [57]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [58]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

In [63]:
# display option
pd.options.display.max_rows = 100

In [64]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [65]:
(df.age < 45) & (df.age > 15)

0       False
1       False
2        True
3       False
4        True
        ...
1374     True
1375    False
1376     True
1377    False
1378     True
Name: age, Length: 1379, dtype: bool

In [68]:
df.age[(df.age < 45) & (df.age > 15)]

2       33
4       43
5       30
8       25
9       30
        ..
1369    24
1373    40
1374    33
1376    37
1378    31
Name: age, Length: 772, dtype: int64

In [67]:
df.age[(df.age < 45) & (df.age > 15)].corr(df.earn)

0.3141178872518905

In [70]:
df.sex.value_counts(sort=True)

1    859
0    520
Name: sex, dtype: int64